In [2]:
import pandas as pd
# data cleaning  -- 1 null vlaue , 2 deduplication , 3 difffernt types of data - transformation 

# ____ HAndle missing Value _____

In [21]:
# 1 - missing values isnull()

df = pd.read_csv("raw_data.csv")

df.isnull()  # jaha pae null value ha ya Nan ha 
df.isna() # same kamm ha isnull jasa

# different function kee chaining
df.isnull().sum()

# dropna() -- null vlaue ko drop kardetaha row ko pura # rows
df.dropna()

# column ko drop karna ha 
df.dropna(axis=1) # column ko drop karta ha 


# fillna -- jo null vlaue usko kisi particular value sae fill karsakta ha
df.fillna(0)

age_mean = df["age"].mean() # avergae value  # lakin ek chiz original mae koi chnage nai hoga
cleaned_data = df.copy()
cleaned_data["age"]=cleaned_data["age"].fillna(age_mean)
cleaned_data

# ffill and bfill - ffill stands for forward fill -- upar sae nicha kae forward kardega upar kee vlaue ko neecha copy kardega asa he backward fill


df.ffill()
df.bfill()

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith  34.0  Canada   Female  62000.0
3    3          Alex  34.0     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female  51000.0
5    5        Li Wei  27.0   China     Male  51000.0
6    6    Ahmed Khan  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     USA     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz  31.0  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [10]:
df

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [26]:
# handle duplicate vales 
# .duplicated()

df.duplicated()
df["country"].duplicated()
df[["country","gender"]].duplicated()

0     False
1      True
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
dtype: bool

In [36]:
df.drop_duplicates()  # yae hamara original data ame tou koi chnage ni dega tou thenham
df2 = df.copy()
df2.fillna(0)
df.drop_duplicates(inplace = True)

In [37]:
df

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [45]:
# handle data types and date time 
df.dtypes
df2 = df.copy()
df2 .fillna(0)
# astype - new data type
#df2 = df["age"].astype("int64").copy()

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   0.0  Canada   Female  62000.0
3    3          Alex   0.0     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      0.0
5    5        Li Wei  27.0   China     Male  51000.0
6    6             0  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0       0     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   0.0  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA        0  58000.0

In [39]:
df2

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [51]:
# date - time 
date_str = pd.Series([pd.to_datetime("2026-12-31")])
type(date_str.dtypes)

numpy.dtypes.DateTime64DType

In [57]:
# handle string in data cleaning
df["gender"].str.lower()
df["gender"].str.upper()
df["gender"].str.capitalize()


df["name"].str.split()
#df["name"].str.split(@)  # harsh@gmail.com
df["country"].str.contains("india",case = False)

0     False
2     False
3     False
4     False
5     False
6      True
7     False
8     False
9     False
10    False
Name: country, dtype: bool